import React from "react";
import { Link } from "react-router-dom";
import "./StartPage.css";

const StartPage = () => {
  return (
    <div>
      <div className="welcome-container">
        <h1>Hello, this is my test task</h1>
        <p>
          Я ніколи не писав валідацію форм раніше. Тут багато хардкода. Я
          спочатку вирішив писати так але потім пошкодував ). На реальному
          проекті для усього б були свої компоненти як кастомний input наприклад
          і все би серіалізовалося по обьєкту. Але вийшло як вийшло. Завдання у
          посиланнях зверху. Алгорим для пошуку в обьєкті я знайшов на Stack
          Overflow того, що сам не зміг написати ). Колись мені викладач на
          курсах по С++ казав що рекурсії треба уникати якщо це можливо і тому я
          рекурсивні функції теж не писав ніколи. Ще я в кінці тільки зрозумів
          що мої RegExp не розуміють кирилицю але це вже мабуть якось іншим
          разом.. Дякую.{" "}
        </p>
      </div>
    </div>
  );
};
export default StartPage;
